Repository: biblibre/omeka-s-module-OctopusViewer
Catalog: language/*.po
Languages: fr

source: Download
fr: Télécharger

source: Toggle fullscreen
fr: Basculer le mode plein écran

source: Show viewer on the item page
fr: Afficher la visionneuse sur la page de contenu

source: Before the item content
fr: Avant le contenu

source: After the item content
fr: Après le contenu

source: Show viewer on the media page
fr: Afficher la visionneuse sur la page de média

source: Before the media content
fr: Avant le contenu

source: After the media content
fr: Après le contenu

source: This setting can be replaced by one or several resource page blocks available in the theme settings. In that case, select "No"
fr: Ce paramètre peut-être remplacé par un bloc ou plusieurs blocs de page de ressource disponibles dans les paramètres de thème. Dans ce cas, sélectionner "Non"

source: IIIF Image URI template
fr: Modèle d'URI IIIF Image

source: If set, it will be used to build an IIIF base URI for media stored locally. The following expressions can be used and will be replaced by their corresponding value: {id}, {storage_id}, {filename}, {extension}
fr: Si défini, sera utilisé pour construire une URI IIIF pour les médias stockés localement. Les expressions suivantes peuvent être utilisées et seront remplacées par leur valeur correspondante: {id}, {storage_id}, {filename}, {extension}

source: Show media selector sidebar
fr: Afficher la barre latérale du sélecteur de média

source: This setting only applies to the full viewer (not the media selector block). It can be overriden in the site settings
fr: Ce paramètre s'applique uniquement à la visionneuse complète (pas au bloc sélecteur de média). Il peut être surchargé dans les paramètres du site

source: Only if there are several media
fr: Seulement s'il y a plusieurs médias

source: Show media selector block
fr: Afficher le bloc sélecteur de média

source: This setting only applies to the media selector block (not the media selector sidebar). It can be overriden in the site settings
fr: Ce paramètre s'applique uniquement au bloc sélecteur de média (et non à la barre latérale du sélecteur de média). Il peut être surchargé dans les paramètres du site

source: Show media info sidebar
fr: Afficher la barre latérale des infos du média

source: This setting only applies to the full viewer (not the media metadata block). It can be overriden in the site settings
fr: Ce paramètre s'applique uniquement à la visionneuse complète (pas au bloc métadonnées du média). Il peut être surchargé dans les paramètres du site

source: Default media title
fr: Titre du média par défaut

source: Text used when a media has no title
fr: Texte utilisé quand un média n'a pas de titre

source: No text
fr: Aucun texte

source: Show download link
fr: Afficher un lien de téléchargement

source: Show a link to download the original file when available (does not work with some media types like Youtube videos for instance)
fr: Affiche un lien pour télécharger le fichier original quand il est disponible (ne fonctionne pas avec certains types de média tels que les vidéos Youtube par exemple)

source: In the media selector panel
fr: Dans panneau de sélection de média

source: In the controls (below media view by default)
fr: Dans les contrôles (sous la vue du média par défaut)

source: In the media selector panel and in the controls
fr: Dans le panneau de sélection de média et dans les contrôles

source: This setting only applies to the full viewer (not the media selector block)
fr: Ce paramètre s'applique uniquement à la visionneuse complète (et non au bloc sélecteur de média)

source: This setting only applies to the media selector block (not the media selector sidebar)
fr: Ce paramètre s'applique uniquement au bloc sélecteur de média (et non à la barre latérale du sélecteur de média)

source: This setting only applies to the full viewer (not the media metadata block)
fr: Ce paramètre s'applique uniquement à la visionneuse complète (et non au bloc métadonnées du média)

source: Octopus viewer media metadata
fr: Octopus viewer métadonnées du média

source: Octopus viewer media view
fr: Octopus viewer vue du média

source: Octopus viewer media selector
fr: Octopus viewer sélecteur de média
