Repository: biblibre/omeka-s-module-OctopusViewer
Catalog: documentation/locales/*/LC_MESSAGES/configuration.po
Languages: fr

source: Settings can be found in two places.
fr: Les paramètres se trouvent dans deux endroits différents.

source: The module configuration page contains :ref:`global settings <global-settings>`
fr: La page de configuration du module contient :ref:`les paramètres globaux <global-settings>`

source: The site configuration page contains :ref:`site settings <site-settings>`
fr: La page de configuration du site contient :ref:`les paramètres du site <site-settings>`

source: Global settings
fr: Paramètres globaux

source: Global settings can be found in the module configuration page.
fr: Les paramètres globaux se trouvent dans la page de configuration du module.

source: Log in to the administration interface
fr: Connectez-vous à l'interface d'administration

source: In the navigation menu on the left, click on the "Modules" link (under "ADMIN" section)
fr: Dans le menu de navigation à gauche, cliquez sur le lien "Modules" (sous la section "ADMIN")

source: Find Octopus Viewer in the list
fr: Trouvez Octopus Viewer dans la liste

source: Click on the corresponding "Configure" button
fr: Cliquez sur le bouton "Configurer" correspondant

source: Show viewer on the item page
fr: Afficher la visionneuse sur la page de contenu

source: This setting is mostly for Omeka S 3.2 and will likely be removed in the future.
fr: Ce paramètre est principalement destiné à Omeka S 3.2 and sera probablement supprimé à l'avenir.

source: For Omeka S 4.x you should let this setting at its default value ("No") and use `resource page blocks <https://omeka.org/s/docs/user-manual/sites/site_theme/#configure-resource-pages>`_ instead.
fr: Pour Omeka S 4.x vous devriez laisser ce paramètre à sa valeur par défaut ("Non") et utiliser les `blocs de page de ressource <https://omeka.org/s/docs/user-manual/sites/site_theme/#configure-resource-pages>`_ à la place.

source: This setting allow you to choose where the viewer will be placed on the item page.
fr: Ce paramètre permet de choisir où la visionneuse sera placée sur la page de contenu.

source: Possible values:
fr: Valeurs possibles:

source: No
fr: Non

source: Do not show the viewer. This can be useful if the theme is already displaying the viewer.
fr: Ne pas afficher la visionneuse. Ça peut être utile si le thème affiche déjà la visionneuse.

source: Before the item content
fr: Avant le contenu

source: Display the viewer before (above) the item content
fr: Affiche la visionneuse avant (au-dessus) du contenu

source: After the item content
fr: Après le contenu

source: Display the viewer after (below) the item content
fr: Affiche la visionneuse après (dessous) le contenu

source: IIIF Image URI template
fr: Modèle d'URI IIIF Image

source: See :doc:`iiif-image-servers`
fr: Voir :doc:`iiif-image-servers`

source: Show media selector
fr: Afficher le sélecteur de médias

source: This setting controls whether the media selector (the left panel) is shown or not. This global setting can be overriden in :ref:`site settings <site-settings>`.
fr: Ce paramètre contrôle si le sélecteur de médias (le panneau de gauche) est affiché ou non. Ce paramètre global peut être surchargé dans :ref:`les paramètres du site <site-settings>`.

source: Only if there are several media
fr: Seulement s'il y a plusieurs médias

source: The media selector will be displayed only there is more than one media to show. This is the default value.
fr: Le sélecteur de média sera affiché seulement s'il y a plus d'un média à afficher. C'est la valeur par défaut.

source: Always
fr: Toujours

source: Always show the media selector, even if there is only one media.
fr: Toujours afficher le sélecteur de média, même s'il n'y a qu'un seul média.

source: Never
fr: Jamais

source: Never show the media selector.
fr: Ne jamais afficher le sélecteur de média.

source: Show media info
fr: Afficher les infos du média

source: This setting controls whether the media info (the right panel) is shown or not. This global setting can be overriden in :ref:`site settings <site-settings>`.
fr: Ce paramètre contrôle si les infos du média (le panneau de droite) est affiché ou non. Ce paramètre global peut être surchargé dans :ref:`les paramètres du site <site-settings>`.

source: Always show the media info.
fr: Toujours afficher les infos du média.

source: Never show the media info.
fr: Ne jamais afficher les infos du média.

source: Default media title
fr: Titre du média par défaut

source: This setting controls what is displayed in the media selector, next to the media thumbnail, if the media does not have a title. This global setting can be overriden in :ref:`site settings <site-settings>`.
fr: Ce paramètre contrôle ce qui est affiché dans le sélecteur du média, à côté de la vignette du média, si le média n'a pas de titre. Ce paramètre global peut être surchargé dans :ref:`les paramètres du site <site-settings>`.

source: [Untitled]
fr: [Sans titre]

source: Display the text "[Untitled]". This is the default behaviour.
fr: Affiche le texte "[Sans titre]". C'est le comportement par défaut.

source: No text
fr: Aucun texte

source: Display no text. Only the thumbnail will be visible.
fr: N'affiche aucun texte. Seule la vignette sera visible.

source: Show download link
fr: Afficher un lien de téléchargement

source: This setting controls whether a download link is shown or not. This global setting can be overriden in :ref:`site settings <site-settings>`.
fr: Ce paramètre contrôle si un lien de téléchargement est affiché ou non. Ce paramètre global peut être surchargé dans :ref:`les paramètres du site <site-settings>`.

source: Do not show a download link. This is the default behaviour.
fr: N'affiche pas de lien de téléchargement. C'est le comportement par défaut.

source: In the media selector panel
fr: Dans le panneau de sélection de média

source: Show a download link next to each media title.
fr: Affiche un lien de téléchargement à côté de chaque titre de média.

source: In the controls
fr: Dans les contrôles

source: Show a download link in the controls, which are below the media view by default.
fr: Affiche un lien de téléchargement dans les contrôles, qui sont sous la vue du média par défaut.

source: In the media selector panel and in the controls
fr: Dans le panneau de sélection de média et dans les contrôles

source: Show download links in both places.
fr: Affiche des liens de téléchargement dans les deux endroits.

source: This does not work for media types where the original file is not stored in Omeka (Youtube videos for instance)
fr: Cela ne fonctionne pas pour les types de média où le fichier original n'est pas stocké dans Omeka (les vidéos Youtube par exemple)

source: Site settings
fr: Paramètres de site

source: Site settings can be found in the `site settings page <https://omeka.org/s/docs/user-manual/sites/site_settings/#settings>`_.
fr: Les paramètres de site se trouvent dans `la page des paramètres de site <https://omeka.org/s/docs/user-manual/sites/site_settings/#settings>`_.

source: In this page there is a section called "Octopus Viewer".
fr: Dans cette page il y a une section nommée "Octopus Viewer".

source: This setting controls whether the media selector (the left panel) is shown or not. This setting overrides the global setting.
fr: Ce paramètre contrôle si le sélecteur de média (le panneau de gauche) est affiché ou non. Ce paramètre surcharge le paramètre global.

source: Use global setting
fr: Utiliser le paramètre global

source: Use the value defined in the :ref:`global settings <global-settings>`. This is the default value.
fr: Utiliser la valeur définie dans :ref:`les paramètres globaux <global-settings>`. C'est la valeur par défaut.

source: The media selector will be displayed only there is more than one media to show.
fr: Le sélecteur de média sera affiché seulement s'il y a plus d'un média à afficher.

source: This setting controls whether the media info (the right panel) is shown or not. This setting overrides the global setting.
fr: Ce paramètre contrôle si les infos du média (le panneau de droite) est affiché ou non. Ce paramètre surcharge le paramètre global.

source: This setting controls what is displayed in the media selector, next to the media thumbnail, if the media does not have a title. This setting overrides the global setting.
fr: Ce paramètre contrôle ce qui est affiché dans le sélecteur de médias, à côté de la vignette du média, si le média n'a pas de titre. Ce paramètre surcharge le paramètre global.

source: Display the text "[Untitled]".
fr: Afficher le texte "[Sans titre]".

source: This setting controls whether a download link is shown or not next to the media title. This setting overrides the global setting.
fr: Ce paramètre contrôle si un lien de téléchargement est affiché ou non. Ce paramètre surcharge le paramètre global.
