Repository: biblibre/omeka-s-module-OctopusViewer
Catalog: documentation/locales/*/LC_MESSAGES/embed.po
Languages: fr

source: Embed the viewer on another site
fr: Embarquer la visionneuse sur un autre site

source: As an iframe
fr: En tant qu'iframe

source: The easiest way to embed the viewer is by using ``<iframe>``.
fr: La manière la plus facile d'embarquer la visionneuse est d'utiliser ``<iframe>``.

source: Add the following HTML code to your site:
fr: Ajoutez le code HTML suivant à votre site:

source: Then replace:
fr: Puis remplacez:

source: ``{BASE_URL}`` by the base URL of Omeka,
fr: ``{BASE_URL}`` par l'URL de base d'Omeka,

source: ``{MEDIA_QUERY}`` by a list of URL parameters separated by ``&`` (this will define which media will be displayed),
fr: ``{MEDIA_QUERY}`` par une liste de paramètres d'URL séparés par ``&`` (ça définira quels médias sont affichés),

source: ``{SITE_SLUG}`` by the identifier of an existing Omeka S site, and
fr: ``{SITE_SLUG}`` par l'identifiant d'un site Omeka S existant, et

source: ``{TITLE}`` by the text to be displayed in the viewer header.
fr: ``{TITLE}`` par le texte à afficher dans l'en-tête de la visionneuse.

source: For instance:
fr: Par exemple:

source: As a web component
fr: En tant que composant web

source: This feature is experimental
fr: Cette fonctionnalité est expérimentale

source: If iframes cannot be used, the viewer can also be embedded on another website as a `web component <https://developer.mozilla.org/en-US/docs/Web/Web_Components>`_.
fr: Si les iframes ne peuvent pas être utilisées, la visionneuse peut aussi être embarquée sur un autre site en tant que `composant web <https://developer.mozilla.org/fr/docs/Web/Web_Components>`_.

source: The style is inlined for convenience, but you can remove it and use your own styles
fr: Le style est mis en ligne par commodité, mais vous pouvez le retirer et utiliser vos propres styles

source: Optional attributes
fr: Attributs optionnels

source: The ``octopusviewer-viewer`` HTML element also understands the following attributes:
fr: L'élément HTML ``octopusviewer-viewer`` comprend également les attributs suivants:

source: Possible values: ``auto`` (default), ``always``, ``never``
fr: Valeurs possibles: ``auto`` (par défaut), ``always``, ``never``

source: Controls whether the media selector (left panel) should be displayed or not. If ``auto``, the media selector will be displayed only if there is more than one media to display. Other values can be used if you want the media selector to be ``always`` or ``never`` displayed.
fr: Contrôle si le sélecteur de médias (panneau de gauche) est affiché ou non. Si ``auto``, le sélecteur de média sera affiché seulement s'il y a plus d'un média à afficher. Les autres valeurs peuvent être utilisées si vous voulez que le sélecteur de média soit toujours (``always``) ou jamais (``never``) affiché.

source: Possible values: ``always`` (default), ``never``
fr: Valeurs possibles: ``always`` (default), ``never``

source: Controls whether the media info (right panel) should be displayed or not. If ``always``, it will always be displayed. If ``never`` it will never be displayed.
fr: Contrôle si les infos du média (panneau de droite) sont affichées ou non. Si ``always``, elles seront toujours affichées. Si ``never``, elles ne seront jamais affichées.
