Repository: biblibre/omeka-s-module-OctopusViewer
Catalog: documentation/locales/*/LC_MESSAGES/iiif-image-servers.po
Languages: fr

source: IIIF Image Servers
fr: Serveurs d'image IIIF

source: In this section you will find a short documentation to get you started with some IIIF Image servers.
fr: Dans cette section vous trouverez une brève documentation pour démarrer avec certains serveurs d'image IIIF.

source: We'll assume Omeka S is served by Apache on a Debian system.
fr: Nous allons supposer que Omeka S est servi par Apache sur un système Debian.

source: Install Cantaloupe
fr: Installer Cantaloupe

source: Start by installing Java::
fr: Commencez par installer Java::

source: Then install Cantaloupe using the `latest release <https://github.com/cantaloupe-project/cantaloupe/releases/latest>`_ ZIP file::
fr: Puis installez Cantaloupe en utilisant le fichier ZIP de la `dernière version <https://github.com/cantaloupe-project/cantaloupe/releases/latest>`_::

source: Configure Cantaloupe
fr: Configurer Cantaloupe

source: Copy the sample configuration file::
fr: Copiez le fichier de configuration d'exemple::

source: Then edit the copy. You will need to define the path to your pyramid images::
fr: Puis modifiez la copie. Vous aurez besoin de définir le chemin vers vos images pyramide::

source: You can use `PyramidImageBuilder`_ to create these pyramid images. If that's what you use, pyramid images will be located in ``<OMEKA_PATH>/files/pyramid/``.
fr: Vous pouvez utiliser `PyramidImageBuilder`_ pour créer ces images pyramide. Si c'est ce que vous utilisez, les images pyramide seront dans ``<OMEKA_PATH>/files/pyramid/``.

source: The trailing slash in ``path_prefix`` is important!
fr: La barre oblique de fin dans ``path_prefix`` est importante!

source: Start Cantaloupe
fr: Démarrer Cantaloupe

source: The simplest way to start Cantaloupe is to run the following commands::
fr: Le moyen le plus simple de démarrer Cantaloupe est de lancer les commandes suivantes::

source: Configure Apache to proxy requests to Cantaloupe
fr: Configurer Apache pour transmettre les requêtes à Cantaloupe

source: Enable Apache modules ``proxy`` and ``proxy_http``::
fr: Activez les modules Apache ``proxy`` et ``proxy_http``::

source: In Apache's ``<VirtualHost>`` for Omeka S (probably located in ``/etc/apache2/sites-enabled/``), add the following lines::
fr: Dans le ``<VirtualHost>`` Apache pour Omeka S (probablement situé dans ``/etc/apache2/sites-enabled/``), ajoutez les lignes suivantes::

source: Then restart Apache::
fr: Puis redémarrez Apache::

source: Configure OctopusViewer
fr: Configurer OctopusViewer

source: In the module configuration, change IIIF Image URI template to::
fr: Dans la configuration du module, modifiez le modèle d'URI IIIF Image::

source: This assumes the pyramid image files are named after the Omeka S media storage ID, which is what `PyramidImageBuilder`_ does. If your images are named differently, modify the URI template accordingly.
fr: Ça suppose que les fichiers d'image pyramide portent le même nom que le *storage ID* du média Omeka S, ce que fait `PyramidImageBuilder`_. Si vos images sont nommées différemment, modifiez le modèle d'URI en conséquence.

source: Install IIPImage
fr: Installer IIPImage

source: Install IIPImage using the debian package::
fr: Installez IIPImage en utilisant le paquet debian::

source: Disable the Apache module, we won't use it::
fr: Désactivez le module Apache, nous n'allons pas l'utiliser::

source: Configure IIPImage
fr: Configurer IIPImage

source: Create ``/etc/default/iipsrv`` with the following contents::
fr: Créez ``/etc/default/iipsrv`` avec le contenu suivant::

source: Replace ``<yourhost>`` by the hostname of your Omeka S installation
fr: Remplacez ``<yourhost>`` par le nom d'hôte de votre installation Omeka S

source: Replace ``<path_to_pyramid_images>`` by the absolute path of the directory that contain your pyramid image files. You can use `PyramidImageBuilder`_ to create these files.
fr: Remplacez ``<path_to_pyramid_images>`` par le chemin absolu du répertoire contenant vos fichiers d'image pyramide. Vous pouvez utiliser `PyramidImageBuilder`_ pour créer ces fichiers.

source: If you use `PyramidImageBuilder`_, pyramid images will be located in ``<OMEKA_PATH>/files/pyramid/``.
fr: Si vous utilisez `PyramidImageBuilder`_, les images pyramide seront dans ``<OMEKA_PATH>/files/pyramid/``.

source: The trailing slash in FILESYSTEM_PREFIX is important!
fr: La barre oblique de fin dans FILESYSTEM_PREFIX est importante!

source: Once the configuration file is ready, restart IIPImage::
fr: Une fois que le fichier de configuration est prêt, redémarrez IIPImage::

source: Configure Apache to proxy requests to IIPImage
fr: Configurer Apache pour transmettre les requêtes à IIPImage

source: Enable Apache modules ``proxy`` and ``proxy_fcgi``::
fr: Activez les modules Apache ``proxy`` et ``proxy_fcgi``::
