Repository: biblibre/omeka-s-module-OctopusViewer
Catalog: documentation/locales/*/LC_MESSAGES/index.po
Languages: fr

source: Theme
fr: Thème

source: Development
fr: Développement

source: OctopusViewer user manual
fr: Manuel utilisateur de OctopusViewer

source: OctopusViewer gathers all your Omeka S media in a lightweight viewer. It's intended to be used as a replacement of other viewers like UniversalViewer or Mirador.
fr: OctopusViewer rassemble tous vos médias Omeka S dans une visionneuse légère. Elle est prévue pour être utilisée en remplacement d'autres visionneuses comme UniversalViewer ou Mirador.

source: However, unlike UniversalViewer and Mirador, OctopusViewer is not a IIIF viewer. In order to use IIIF manifests with OctopusViewer, they should be added to Omeka S as "IIIF presentation" media (requires Omeka S 4.0.0 or higher).
fr: En revanche, contrairement à UniversalViewer et Mirador, OctopusViewer n'est pas une visionneuse IIIF. Pour utiliser des manifestes IIIF avec OctopusViewer, ils doivent être ajoutés à Omeka S en tant que média "IIIF presentation" (nécessite Omeka S 4.0.0 ou plus).

source: UniversalViewer and Mirador are great tools but they come with some limitations when using them in Omeka S:
fr: UniversalViewer et Mirador sont d'excellents outils mais ils ont quelques limites quand ils sont utilisés dans Omeka S:

source: They require a IIIF Presentation manifest, which often means an additional module should be installed
fr: Ils nécessitent un manifeste IIIF, ce qui veut souvent dire que des modules supplémentaires doivent être installés

source: They support only a subset of Omeka S media types
fr: Ils supportent seulement un sous-ensemble des types de médias Omeka S

source: They are not easy to customize in Omeka S themes
fr: Ils ne sont pas faciles à personnaliser dans les thèmes Omeka S

source: The goals of OctopusViewer are:
fr: Les objectifs de OctopusViewer sont:

source: it should be able to display all types of media, falling back to a sensible default when a media cannot be rendered in a browser
fr: il doit être capable d'afficher tous les types de média, avec un affichage par défaut sensé dans les cas où le média ne peut pas être affiché dans un navigateur

source: it should use as few external dependencies as possible, favoring the tools that are already available on an empty Omeka S installation (like OpenSeadragon)
fr: il doit utiliser le moins de dépendances externes possible, en privilégiant les outils déjà disponibles dans Omeka S (comme OpenSeadragon)

source: it should require no additional Omeka S modules, but should be extensible by them
fr: il ne doit dépendre d'aucun autre module Omeka S, mais doit pouvoir être étendu par d'autres modules

source: it should be easily customizable in Omeka S themes
fr: il doit être facilement personnalisable dans les thèmes Omeka S

source: Features
fr: Fonctionnalités

source: A viewer split into 3 panels:
fr: Une visionneuse divisée en 3 panneaux:

source: the left panel contains a media selector
fr: le panneau de gauche contient un sélecteur de média

source: the center panel renders the media
fr: le panneau central affiche le média

source: the right panel displays metadata for the currently selected media
fr: le panneau de droite affiche les métadonnées du média sélectionné

source: Images are displayed within OpenSeadragon, allowing to zoom, rotate, and flip images
fr: Les images sont affichées dans OpenSeadragon, ce qui permet de zoomer, faire pivoter, et retourner les images

source: An optional IIIF Image server can be used
fr: Un serveur d'image IIIF optionnel peut-être utilisé

source: PDF files are displayed with `pdfjs <https://mozilla.github.io/pdf.js/>`_.
fr: Les fichiers PDF sont affichés avec `pdfjs <https://mozilla.github.io/pdf.js/>`_.

source: Fullscreen mode
fr: Mode plein écran

source: See general end user documentation for `installing a module <http://omeka.org/s/docs/user-manual/modules/#installing-modules>`_.
fr: Voir la documentation utilisateur pour `installer un module <http://omeka.org/s/docs/user-manual/modules/#installing-modules>`_.

source: License
fr: Licence

source: OctopusViewer is distributed under the GNU General Public License, version 3. The full text of this license is given in the ``LICENSE`` file.
fr: OctopusViewer est distribué sous la licence publique générale GNU, version 3. Le texte complet de cette licence est dans le fichier ``LICENSE``.
