Repository: biblibre/omeka-s-module-OctopusViewer
Catalog: documentation/locales/*/LC_MESSAGES/theme.po
Languages: fr

source: Customize viewer appearance
fr: Personnaliser l'apparence de la visionneuse

source: One of the simplest way is to add CSS to a file named ``asset/css/octopusviewer-viewer-extra.css``.
fr: Une des façons les plus simples est d'ajouter du CSS à un fichier nommé ``asset/css/octopusviewer-viewer-extra.css``.

source: It will be automatically loaded inside the viewer's shadow DOM (which means it won't affect anything but the viewer).
fr: Il sera automatiquement chargé à l'intérieur du *shadow DOM* de la visionneuse (ce qui signifie qu'il n'affectera que la visionneuse).

source: This requires OctopusViewer 0.5.0 or higher.
fr: Cela nécessite OctopusViewer 0.5.0 ou plus.

source: The PDF viewer is a little bit different because it's inside an iframe, so it requires another CSS file. Create a file named ``asset/css/pdfjs-viewer.css`` and it will be included in the PDF viewer's iframe.
fr: La visionneuse PDF est un peu différente parce qu'elle est à l'intérieur d'une *iframe*, donc elle nécessite un autre fichier CSS. Créez un fichier nommé ``asset/css/pdfjs-viewer.css`` et il sera inclus dans l'*iframe* de la visionneuse PDF.

source: This requires OctopusViewer 0.3.0 or higher.
fr: Cela nécessite OctopusViewer 0.3.0 ou plus.

source: Resource page blocks
fr: Blocs de page de ressource

source: OctopusViewer provides 4 different blocks that you can `place on resource pages <https://omeka.org/s/docs/user-manual/sites/site_theme/#configure-resource-pages>`__.
fr: OctopusViewer fournit 4 blocs différents que vous pouvez `placer sur les pages de ressource <https://omeka.org/s/docs/user-manual/sites/site_theme/#configure-resource-pages>`__.

source: Available for: item, media.
fr: Disponible pour: contenu, média.

source: This is the full viewer, with two sidebars. One contains a media selector and the other contains metadata about the selected media.
fr: C'est la visionneuse complète, avec deux barres latérales. Une contient un sélecteur de média et l'autre contient les métadonnées du média sélectionné.

source: The media selector is disabled on a media page.
fr: Le sélecteur de média est désactivé sur la page d'un média.

source: Octopus viewer media selector
fr: Octopus viewer sélecteur de média

source: Available for: item.
fr: Disponible pour: contenu.

source: This is the media selector. It displays the item's media and allows users to select one. When other blocks are present on the page (:ref:`octopus-viewer-media-view` and :ref:`octopus-viewer-media-metadata`), it updates them.
fr: C'est le sélecteur de média. Il affiche les médias du contenu et permet aux utilisateurs d'en sélectionner un. Quand d'autres blocs sont présent sur la page (:ref:`octopus-viewer-media-view` et :ref:`octopus-viewer-media-metadata`), cela les actualise.

source: Octopus viewer media view
fr: Octopus viewer vue du média

source: This is where the media is displayed.
fr: C'est ici que le média est affiché.

source: It can be controlled by the "Octopus viewer (media selector)" block.
fr: Il peut être contrôlé par le bloc "Octopus viewer (media selector)".

source: Octopus viewer media metadata
fr: Octopus viewer métadonnées du média

source: Available for item, media.
fr: Disponible pour: contenu, média.

source: This displays metadata about the selected item.
fr: Cela affiche les métadonnées du média sélectionné.

source: The following template files can be overriden by themes:
fr: Les fichiers de *template* suivants peuvent être surchargés par les thèmes:

source: Used on the item "show" page and everywhere the view helper's ``forItem`` method is used.
fr: Utilisé sur la page de détail d'un contenu et partout où la méthode ``forItem`` du *view helper* est utilisée.

source: Used in the embedded view (when included in an iframe for instance) and everywhere the view helper's ``viewer`` method is used.
fr: Utilisé dans la vue embarquée (quand elle est incluse dans une iframe par exemple) et partout où la méthode ``viewer`` du *view helper* est utilisée.

source: The content of the right panel.
fr: Le contenu du panneau de droite.

source: The content of the left panel.
fr: Le contenu du panneau de gauche.

source: This is not an exhaustive list. For the full list of template files, look at `the view directory in the sources <https://github.com/biblibre/omeka-s-module-OctopusViewer/tree/master/view>`_
fr: Ce n'est pas une liste exhaustive. Pour la liste complète des fichiers de *template*, regarder `le dossier view dans les sources <https://github.com/biblibre/omeka-s-module-OctopusViewer/tree/master/view>`_

source: You can use this view helper to display the viewer for all media of an item like this::
fr: Vous pouvez utiliser ce *view helper* pour afficher la visionneuse pour tous les médias d'un contenu comme ça::

source: Or you can display any media matching some criteria::
fr: Ou vous pouvez afficher n'importe quels médias correspondants à certains critères::

source: For instance, ::
fr: Par exemple, ::

source: The list of available parameters can be found in `Omeka S developer documentation (API reference) <https://omeka.org/s/docs/developer/api/api_reference/#parameters-for-media>`_.
fr: La liste des paramètres disponibles se trouve dans la `documentation développeur Omeka S (référence API) <https://omeka.org/s/docs/developer/api/api_reference/#parameters-for-media>`_.
